# # Дни недели
# DAYS = ("Понедельник", "Вторник", "Среда", "Четверг", "Пятница")
#
# # Количество дней
# COUNT_DAYS = 5
#
# # Классы школы
# classes = [
#     {"grade": "5", "letter": "A"},
#     {"grade": "5", "letter": "B"},
#     {"grade": "6", "letter": "A"},
#     {"grade": "6", "letter": "B"},
#     {"grade": "7", "letter": "A"},
#     {"grade": "8", "letter": "A"},
#     {"grade": "9", "letter": "A"},
#     {"grade": "10", "letter": ""},
#     {"grade": "11", "letter": ""},
# ]
#
# # Количество уроков за неделю для каждого класса
# academic_load_per_week = {
#     "5": 30,
#     "6": 30,
#     "7": 32,
#     "8": 33,
#     "9": 33,
#     "10": 34,
#     "11": 34
# }
#
# # Предметы и их количество уроков в каждом классе на неделю
# subjects = {
#     "Математика": {"5A": 5, "5B": 5, "6A": 5, "6B": 5, "7A": 6, "8A": 6, "9A": 6, "10": 6, "11": 6},
#     "Русский язык": {"5A": 4, "5B": 4, "6A": 4, "6B": 4, "7A": 4, "8A": 4, "9A": 4, "10": 4, "11": 4},
#     "Английский язык": {"5A": 3, "5B": 3, "6A": 3, "6B": 3, "7A": 3, "8A": 3, "9A": 3, "10": 3, "11": 3},
#     "Физкультура": {"5A": 2, "5B": 2, "6A": 2, "6B": 2, "7A": 2, "8A": 2, "9A": 2, "10": 2, "11": 2},
#     "История": {"5A": 2, "5B": 2, "6A": 3, "6B": 3, "7A": 3, "8A": 3, "9A": 3, "10": 2, "11": 2},
#     "География": {"5A": 2, "5B": 2, "6A": 2, "6B": 2, "7A": 2, "8A": 2, "9A": 2, "10": 1, "11": 1},
#     "Химия": {"8A": 2, "9A": 2, "10": 2, "11": 2},
#     "Физика": {"7A": 2, "8A": 3, "9A": 3, "10": 3, "11": 3},
#     "Информатика": {"8A": 2, "9A": 2, "10": 2, "11": 2},
#     "Литература": {"5A": 2, "5B": 2, "6A": 2, "6B": 2, "7A": 2, "8A": 2, "9A": 2, "10": 2, "11": 2},
# }
#
# # Учителя и их связь с классами и предметами
# teachers = {
#     "Иван Иванов": {
#         "subjects": {"Математика": ["5A", "5B", "6A", "6B", "7A"]},
#         "available_days": ["Понедельник", "Вторник", "Среда", "Четверг"],
#     },
#     "Ольга Петрова": {
#         "subjects": {"Русский язык": ["5A", "6A", "7A"], "Литература": ["5A", "6A"]},
#         "available_days": ["Понедельник", "Вторник", "Пятница"],
#     },
#     "Елена Смирнова": {
#         "subjects": {"Английский язык": ["5B", "6B", "7A", "8A"]},
#         "available_days": ["Вторник", "Среда", "Четверг"],
#     },
#     "Дмитрий Павлов": {
#         "subjects": {"Физкультура": ["5A", "5B", "6A", "7A", "8A", "9A"]},
#         "available_days": ["Понедельник", "Среда", "Пятница"],
#     },
#     "Анна Сидорова": {
#         "subjects": {"История": ["6B", "7A", "8A"], "География": ["5A", "6A", "7A"]},
#         "available_days": ["Вторник", "Четверг", "Пятница"],
#     },
#     "Виктор Васильев": {
#         "subjects": {"Физика": ["8A", "9A", "10", "11"], "Химия": ["8A", "9A", "10", "11"]},
#         "available_days": ["Среда", "Четверг", "Пятница"],
#     },
#     "Мария Кузьмина": {
#         "subjects": {"Информатика": ["8A", "9A", "10", "11"]},
#         "available_days": ["Понедельник", "Вторник", "Пятница"],
#     },
# }