from random import randint

# grade = random.randint(5, 11)
# letter = random.choice(["А", "Б", "В", "Г"])

DAYS = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница"]
COUNT_DAYS = 5

# Классы школы
classes = [
    {"grade": "5", "letter": "А"},
    {"grade": "5", "letter": "Б"},
    {"grade": "6", "letter": "А"},
    {"grade": "6", "letter": "Б"},
    {"grade": "7", "letter": "А"},
    {"grade": "8", "letter": "А"},
    {"grade": "9", "letter": "А"},
    {"grade": "10", "letter": "А"},
    {"grade": "11", "letter": "А"},
]

academic_load_per_week = {
    "5": 30,
    "6": 30,
    "7": 32,
    "8": 33,
    "9": 33,
    "10": 34,
    "11": 35
}

subjects = {
    "Математика": {"5А": 5, "5Б": 5, "6А": 5, "6Б": 5, "7А": 6, "8А": 6, "9А": 6, "10А": 6, "11А": 6},
    "Русский язык": {"5А": 4, "5Б": 4, "6А": 4, "6Б": 4, "7А": 4, "8А": 4, "9А": 4, "10А": 4, "11А": 4},
    "Английский язык": {"5А": 3, "5Б": 3, "6А": 3, "6Б": 3, "7А": 3, "8А": 3, "9А": 3, "10А": 3, "11А": 3},
    "Физкультура": {"5А": 2, "5Б": 2, "6А": 2, "6Б": 2, "7А": 2, "8А": 2, "9А": 2, "10А": 2, "11А": 2},
    "История": {"5А": 2, "5Б": 2, "6А": 3, "6Б": 3, "7А": 3, "8А": 3, "9А": 3, "10А": 2, "11А": 2},
    "География": {"5А": 2, "5Б": 2, "6А": 2, "6Б": 2, "7А": 2, "8А": 2, "9А": 2, "10А": 1, "11А": 1},
    "Химия": {"8А": 2, "9А": 2, "10А": 2, "11А": 2},
    "Физика": {"7А": 2, "8А": 3, "9А": 3, "10А": 3, "11А": 3},
    "Информатика": {"8А": 2, "9А": 2, "10А": 2, "11А": 2},
    "Литература": {"5А": 2, "5Б": 2, "6А": 2, "6Б": 2, "7А": 2, "8А": 2, "9А": 2, "10А": 2, "11А": 2},
}

teachers = {
    "Иван Иванов": {
        "subjects": {"Математика": ["5А", "5Б", "6А", "6Б", "7А"]},
        "available_days": ["Понедельник", "Вторник", "Среда", "Четверг"],
    },
    "Ольга Петрова": {
        "subjects": {"Русский язык": ["5А", "6А", "7А"], "Литература": ["5А", "6А"]},
        "available_days": ["Понедельник", "Вторник", "Пятница"],
    },
    "Елена Смирнова": {
        "subjects": {"Английский язык": ["5Б", "6Б", "7А", "8А"]},
        "available_days": ["Вторник", "Среда", "Четверг"],
    },
    "Дмитрий Павлов": {
        "subjects": {"Физкультура": ["5А", "5Б", "6А", "7А", "8А", "9А"]},
        "available_days": ["Понедельник", "Среда", "Пятница"],
    },
    "Анна Сидорова": {
        "subjects": {"История": ["6Б", "7А", "8А"], "География": ["5А", "6А", "7А"]},
        "available_days": ["Вторник", "Четверг", "Пятница"],
    },
    "Виктор Васильев": {
        "subjects": {"Физика": ["8А", "9А", "10А", "11А"], "Химия": ["8А", "9А", "10А", "11А"]},
        "available_days": ["Среда", "Четверг", "Пятница"],
    },
    "Мария Кузьмина": {
        "subjects": {"Информатика": ["8А", "9А", "10А", "11А"]},
        "available_days": ["Понедельник", "Вторник", "Пятница"],
    },
}

# with open("male_names_rus.txt", "r", encoding="utf-8") as file: names = file.readlines()
# with open("male_surnames_rus.txt", "r", encoding="utf-8") as file: surnames = file.readlines()
# names = [names[randint(0, 734)].rstrip() for _ in range(14)]
# surnames = [surnames[randint(0, 14650)].rstrip() for _ in range(14)]

# teachers = {f"{names[i]} {surnames[i]}": {"subjects": {list(subjects.keys())[i]: ["10А"]}, "available_days": DAYS} for i in range(14)}
# Учителя и их связь с классами и предметами



