import random

# Дни недели и уроки
weekday = {
    "Понедельник":{},
    "Вторник":{},
    "Среда":{},
    "Четверг":{},
    "Пятница":{}
}

# Условное количество уроков для классов с 5 по 11
schedules = {
    5: {
        'Математика': 5,
        'Русский язык': 4,
        'Литература': 3,
        'История': 2,
        'География': 2,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 0,
        'Химия': 0,
        'Информатика': 1,
        'Физическая культура': 3,
        'Музыка': 1,
        'ИЗО': 1,
        'Технология': 1
    },
    6: {
        'Математика': 5,
        'Русский язык': 4,
        'Литература': 3,
        'История': 2,
        'География': 2,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 0,
        'Химия': 0,
        'Информатика': 1,
        'Физическая культура': 3,
        'Музыка': 1,
        'ИЗО': 1,
        'Технология': 1
    },
    7: {
        'Математика': 5,
        'Русский язык': 4,
        'Литература': 3,
        'История': 2,
        'География': 2,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 2,
        'Химия': 1,
        'Информатика': 1,
        'Физическая культура': 3,
        'Технология': 1
    },
    8: {
        'Алгебра': 4,
        'Геометрия': 3,
        'Русский язык': 3,
        'Литература': 2,
        'История': 2,
        'Обществознание': 1,
        'География': 1,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 3,
        'Химия': 1,
        'Информатика': 1,
        'Физическая культура': 2,
        'ОБЖ': 1,
        'Технология': 1
    },
    9: {
        'Алгебра': 4,
        'Геометрия': 3,
        'Русский язык': 2,
        'Литература': 2,
        'История': 2,
        'Обществознание': 1,
        'География': 1,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 3,
        'Химия': 1,
        'Информатика': 1,
        'Физическая культура': 2,
        'ОБЖ': 1,
        'Технология': 1
    },
    10: {
        'Алгебра': 4,
        'Геометрия': 3,
        'Русский язык': 2,
        'Литература': 2,
        'История': 2,
        'Обществознание': 2,
        'География': 1,
        'Иностранный язык': 3,
        'Биология': 2,
        'Физика': 4,
        'Химия': 2,
        'Информатика': 1,
        'Физическая культура': 2,
        'Индивидуальный проект': 1,
        'ОБЖ': 1
    },
    11: {
        'Алгебра': 4,
        'Геометрия': 3,
        'Русский язык': 2,
        'Литература': 2,
        'История': 2,
        'Обществознание': 2,
        'География': 1,
        'Иностранный язык': 3,
        'Биология': 1,
        'Физика': 4,
        'Химия': 2,
        'Информатика': 2,
        'Физическая культура': 2,
        'Индивидуальный проект': 1,
        'ОБЖ': 1
    }
}


for day in weekday.keys():
    for grade in schedules.keys():
        weekday[day][grade] = {}
        for lesson in range(1, 8):
            print(grade, lesson)
            weekday[day][grade][lesson] = None
            while sum(schedules[grade].values()) > 0:
                subj = random.choice(list(schedules[grade]))
                if schedules[grade][subj] > 0:
                    weekday[day][grade][lesson] = subj
                    schedules[grade][subj] -= 1
                    break



for day, grades in weekday.items():
    if weekday[day]:
        print(day)
        for grade in grades:
            print(grade, weekday[day][grade])


